INSERT INTO curri (cno, lno, content) VALUES
(1, 1, '웹개발 프로그래밍 입문'),
(2, 1, 'HTML 기초'),
(3, 1, 'CSS 스타일링'),
(4, 1, 'JavaScript 기초'),
(5, 1, '웹 개발 프레임워크'),
(6, 1, '백엔드 개발 기초'),
(7, 1, '웹 보안 기초'),
(8, 1, '데이터베이스 관리'),
(9, 1, '웹 호스팅 및 배포'),
(10, 1, '웹 개발 프로젝트');

INSERT INTO curri (cno, lno, content) VALUES
(1, 2, '게임 개발 프로그래밍 기초'),
(2, 2, '게임 엔진 개발'),
(3, 2, '2D 게임 디자인'),
(4, 2, '3D 게임 모델링'),
(5, 2, '사운드 및 음악 디자인'),
(6, 2, '게임 물리 엔진'),
(7, 2, '게임 테스팅 및 디버깅'),
(8, 2, '모바일 게임 개발'),
(9, 2, '게임 개발 프로젝트'),
(10, 2, '게임 배포 및 마케팅');

INSERT INTO curri (cno, lno, content) VALUES
(1, 3, '깃과 버전 관리 개요'),
(2, 3, '깃 저장소 생성 및 관리'),
(3, 3, '브랜치와 병합'),
(4, 3, '협업과 깃허브'),
(5, 3, '깃허브 페이지 개발'),
(6, 3, '문제 해결과 이슈 관리'),
(7, 3, '깃플로우 전략'),
(8, 3, '깃허브 액션과 CI/CD'),
(9, 3, '깃허브 보안 및 권한 관리'),
(10, 3, '깃허브 API와 확장 기능');

INSERT INTO curri (cno, lno, content) VALUES
(1, 4, '수학의 기초 개념'),
(2, 4, '정수와 소수'),
(3, 4, '대수학과 방정식'),
(4, 4, '기하학과 도형'),
(5, 4, '확률과 통계'),
(6, 4, '비례 및 비율'),
(7, 4, '직선과 각'),
(8, 4, '좌표 평면과 그래프'),
(9, 4, '삼각형과 삼각함수'),
(10, 4, '중학교 수학 프로젝트');

INSERT INTO curri (cno, lno, content) VALUES
(1, 5, '영어 알파벳과 발음'),
(2, 5, '일상 생활 영어'),
(3, 5, '문법과 문장 구조'),
(4, 5, '어휘력 향상'),
(5, 5, '독해와 작문 기술'),
(6, 5, '문화와 역사적 배경'),
(7, 5, '영어 회화 연습'),
(8, 5, '영어 문학과 작품 분석'),
(9, 5, '비즈니스 영어'),
(10, 5, '중학교 영어 프로젝트');


INSERT INTO curri (cno, lno, content) VALUES
(1, 6, '덧셈과 뺄셈'),
(2, 6, '곱셈과 나눗셈'),
(3, 6, '분수와 소수'),
(4, 6, '도형과 측정'),
(5, 6, '시간과 시계'),
(6, 6, '문제 풀이 기술'),
(7, 6, '수학 놀이와 게임'),
(8, 6, '그래프와 차트'),
(9, 6, '수학 프로젝트'),
(10, 6, '수학의 실생활 응용');

INSERT INTO curri (cno, lno, content) VALUES
(1, 7, '영어 알파벳과 발음'),
(2, 7, '일상 생활 영어'),
(3, 7, '단어와 문장 구조'),
(4, 7, '동사와 형용사'),
(5, 7, '독해와 작문 기술'),
(6, 7, '영어 노래와 놀이'),
(7, 7, '문화와 관례'),
(8, 7, '영어 회화 연습'),
(9, 7, '영어 이야기와 시집'),
(10, 7, '초등학교 영어 프로젝트');

INSERT INTO curri (cno, lno, content) VALUES
(1, 8, '자바 프로그래밍 기초'),
(2, 8, '자바 데이터 타입'),
(3, 8, '자바 연산자'),
(4, 8, '자바 제어문'),
(5, 8, '자바 배열과 컬렉션'),
(6, 8, '자바 객체지향 프로그래밍'),
(7, 8, '자바 예외 처리'),
(8, 8, '자바 입출력'),
(9, 8, '자바 스레드와 동시성'),
(10, 8, '자바 웹 애플리케이션 개발');

